# W1M2 - SQL Tutorial

#### 학습 목표
SQL의 기초에 대해서 공부합니다.
Tutorial의 Home에서부터 Operators까지 읽고 Example을 실행합니다.
Jupyter Notebook에서 SQL을 사용해서 데이터를 처리하는 것을 공부합니다.

#### 기능요구사항
Jupyter Notebook을 만듭니다.
SQL Tutorials에서 Example을 하나씩 수행하고 그 결과를 노트북에 출력하세요.
원하는 출력결과를 얻기 위해 필요하다면 적합한 Demo Table을 만들어야 합니다.

#### 프로그래밍 요구사항
sqlite3 라이브러리를 사용하세요

#### pandas와 같은 라이브러리는 사용해서는 안됩니다. SQL 명령어로만 원하는 결과를 얻어야 합니다.

#### 예상결과 및 동작예시
Query의 결과가 출력된 Jupyter notebook을 제출하세요.

#### 팀 활동 요구사항
각자가 이해하기 어려웠던, 또는 이해하지 못한 keyword에 대해서 함께 토의해 봅시다. 그 결과를 개인 위키에 기록하세요.

---

# SQL Tutorial Example

In [2]:

import sqlite3

conn = sqlite3.connect('./M2.db')
cur = conn.cursor()
sql = open('/Users/admin/Documents/GitHub/Daily_Softeer/Missions/Week1/W1M2/hjw_sql.sql', 'r').read()

# init db
cur.executescript(sql)

# 6줄만 나오도록 제한
# def print_query(query, limit=6):
#     cur.execute(query)
#     print(query)
#     i = 0
#     for row in cur:
#         if i >= limit:
#             print('...')
#             break
#         print(row)
#         i += 1
#     print('-' * 50)
    

def print_query(query, limit=6):
    print(query)
    """Execute a query and print the result with an optional limit."""
    cur.execute(query)
    results = cur.fetchall()
    
    # 프린트 줄의 제한
    print("Query Results:")
    for idx, row in enumerate(results):
        if idx >= limit:
            print(f"...and {len(results) - limit} more rows.")
            break
        print(row)
    
    # Calculate and print the total rows if no limit is applied
    if limit:
        print(f"Total rows (if limit is removed): {len(results)}")
    
    print('-' * 50)

#### SQL SELECT Statement

In [3]:
print_query('SELECT * FROM Customers')

SELECT * FROM Customers
Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

In [4]:
print_query('SELECT Address FROM Customers')

SELECT Address FROM Customers
Query Results:
('Obere Str. 57',)
('Avda. de la Constitución 2222',)
('Mataderos 2312',)
('120 Hanover Sq.',)
('Berguvsvägen 8',)
('Forsterstr. 57',)
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

#### SQL SELECT DISTINCT

In [5]:
print_query('SELECT DISTINCT Country FROM Customers')
print_query('SELECT Country FROM Customers')
print_query('SELECT COUNT(DISTINCT Country) FROM Customers')

SELECT DISTINCT Country FROM Customers
Query Results:
('Germany',)
('Mexico',)
('UK',)
('Sweden',)
('France',)
('Spain',)
...and 15 more rows.
Total rows (if limit is removed): 21
--------------------------------------------------
SELECT Country FROM Customers
Query Results:
('Germany',)
('Mexico',)
('Mexico',)
('UK',)
('Sweden',)
('Germany',)
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------
SELECT COUNT(DISTINCT Country) FROM Customers
Query Results:
(21,)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL WHERE

In [6]:
WHERE_query_1 = '''
              SELECT * FROM Customers
              WHERE Country="Mexico"
              '''
print_query(WHERE_query_1)

WHERE_query_2 = '''
              SELECT * FROM Customers
              WHERE CustomerID=1;
              '''
print_query(WHERE_query_2)

WHERE_query_3 = '''
              SELECT * FROM Customers
              WHERE CustomerID > 80
              '''
print_query(WHERE_query_3)

              SELECT * FROM Customers
              WHERE Country="Mexico"

Query Results:
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico')
(80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico')
Total rows (if limit is removed): 5
--------------------------------------------------

              SELECT * FROM Customers
              WHERE CustomerID=1;

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------

              SELECT * FROM Customers
              WHERE CustomerID > 80

Query Results:
(81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil')
(82, "Trail''s Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')
(83, 'Vaffeljernet', 'Palle Ibsen', 'Smagsløget 45', 'Århus', '8200', 'Denmark')
(84, 'Victuailles en stock', 'Mary Saveley', '2, rue du Commerce', 'Lyon', '69004', 'France')
(85, 'Vins et alcools Chevalier', 'Paul Henriot', "59 rue de l''Abbaye", 'Reims', '51100', 'France')
(86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany')
...and 5 more rows.
Total rows (if limit is removed): 11
--------------------------------------------------

#### SQL ORDER BY

In [7]:
ORDER_BY_query = '''
SELECT * FROM Products
ORDER BY Price
'''
                 
print_query(ORDER_BY_query)


ORDER_BY_DESC_query = '''
SELECT * FROM Products
ORDER BY Price DESC
'''
                 
print_query(ORDER_BY_DESC_query)


# Alphabetically
ORDER_BY_Alp = ''' 
SELECT * FROM Products
ORDER BY ProductName
'''
print_query(ORDER_BY_Alp)

SELECT * FROM Products
ORDER BY Price

Query Results:
(33, 'Geitost', 15, 4, '500 g', 2.5)
(24, 'Guaraná Fantástica', 10, 1, '12 - 355 ml cans', 4.5)
(13, 'Konbu', 6, 8, '2 kg box', 6)
(52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7)
(54, 'Tourtière', 25, 6, '16 pies', 7.45)
(75, 'Rhönbräu Klosterbier', 12, 1, '24 - 0.5 l bottles', 7.75)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

SELECT * FROM Products
ORDER BY Price DESC

Query Results:
(38, 'Côte de Blaye', 18, 1, '12 - 75 cl bottles', 263.5)
(29, 'Thüringer Rostbratwurst', 12, 6, '50 bags x 30 sausgs.', 123.79)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
(20, "Sir Rodney's Marmalade", 8, 3, '30 gift boxes', 81)
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(59, 'Raclette Courdavault', 28, 4, '5 kg pkg.', 55)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

SELECT * FROM Products
ORDER BY ProductName

Query Results:
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4)
(60, 'Camembert Pierrot', 28, 4, '15 - 300 g rounds', 34)
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [8]:
# ORDER BY Several Columns
ORDER_BY_sev = ''' 
SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC
'''
print_query(ORDER_BY_sev)

SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC

Query Results:
(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina')
(54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina')
(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina')
(59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', '5020', 'Austria')
(20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria')
(76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium')
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

#### SQL AND

**AND vs OR**  
AND	모든 조건이 TRUE일 경우 레코드 반환	(모든 조건 만족해야)  
OR	하나 이상의 조건이 TRUE일 경우 레코드 반환 (하나만 만족)

In [9]:
AND_qu = ''' 
SELECT *
FROM Customers
WHERE Country = "Spain" AND CustomerName LIKE "G%"
'''
print_query(AND_qu)


AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Germany'
AND City = 'Berlin'
AND PostalCode > 12000
'''
print_query(AND_qu)

# 괄호를 사용하여 연산의 우선순위를 명확히 지정해야 올바른 결과를 얻을 수 있다
AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')
'''
print_query(AND_qu)


AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%'
'''
print_query(AND_qu)

SELECT *
FROM Customers
WHERE Country = "Spain" AND CustomerName LIKE "G%"

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
Total rows (if limit is removed): 2
--------------------------------------------------

SELECT * FROM Customers
WHERE Country = 'Germany'
AND City = 'Berlin'
AND PostalCode > 12000

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------

SELECT * FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
Total rows (if limit is removed): 3
--------------------------------------------------

SELECT * FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%'

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina')
(65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA')
(66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy')
(67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil')
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------

#### SQL OR Operator

In [10]:
OR_query = ''' 
SELECT *
FROM Customers
WHERE Country = 'Germany' OR Country = 'Spain'
'''
print_query(OR_query)


OR_query = ''' 
SELECT * FROM Customers
WHERE City = 'Berlin' OR CustomerName LIKE 'G%' OR Country = 'Norway'
'''
print_query(OR_query)


# Combining AND and OR
AND_OR_query = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')
'''
print_query(AND_OR_query)


AND_OR_query = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%'
'''
print_query(AND_OR_query)

SELECT *
FROM Customers
WHERE Country = 'Germany' OR Country = 'Spain'

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany')
...and 10 more rows.
Total rows (if limit is removed): 16
--------------------------------------------------

SELECT * FROM Customers
WHERE City = 'Berlin' OR CustomerName LIKE 'G%' OR Country = 'Norway'

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil')
(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA')
(33, 'GROSELLA-Restaurante', 'Manuel Pereira', '5ª Ave. Los Palos Grandes', 'Caracas', '1081', 'Venezuela')
...and 1 more rows.
Total rows (if limit is removed): 7
--------------------------------------------------

SELECT * FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
Total rows (if limit is removed): 3
--------------------------------------------------

SELECT * FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%'

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina')
(65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA')
(66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy')
(67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil')
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------

#### SQL NOT Operator

In [11]:
NOT_query = ''' 
SELECT * FROM Customers
WHERE NOT Country = 'Spain'
'''
print_query(NOT_query)


# NOT LIKE
NOT_query = ''' 
SELECT * FROM Customers
WHERE CustomerName NOT LIKE 'A%'
'''
print_query(NOT_query)

SELECT * FROM Customers
WHERE NOT Country = 'Spain'

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 80 more rows.
Total rows (if limit is removed): 86
--------------------------------------------------

SELECT * FROM Customers
WHERE CustomerName NOT LIKE 'A%'

Query Results:
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(9, "Bon app''", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France')
(10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada')
...and 81 more rows.
Total rows (if limit is removed): 87
--------------------------------------------------

In [12]:
# NOT BETWEEN
NOT_query = ''' 
SELECT * FROM Customers
WHERE CustomerID NOT BETWEEN 10 AND 60
'''
print_query(NOT_query)


# NOT IN
NOT_query = ''' 
SELECT * FROM Customers
WHERE City NOT IN ('Paris', 'London')
'''
print_query(NOT_query)

SELECT * FROM Customers
WHERE CustomerID NOT BETWEEN 10 AND 60

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 34 more rows.
Total rows (if limit is removed): 40
--------------------------------------------------

SELECT * FROM Customers
WHERE City NOT IN ('Paris', 'London')

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
...and 77 more rows.
Total rows (if limit is removed): 83
--------------------------------------------------

In [13]:
# NOT GREATER Than
NOT_query = ''' 
SELECT * FROM Customers
WHERE NOT CustomerID > 50
'''
print_query(NOT_query)


# NOT Less Than
NOT_query = ''' 
SELECT * FROM Customers
WHERE NOT CustomerId < 50
'''
print_query(NOT_query)

SELECT * FROM Customers
WHERE NOT CustomerID > 50

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 44 more rows.
Total rows (if limit is removed): 50
--------------------------------------------------

SELECT * FROM Customers
WHERE NOT CustomerId < 50

Query Results:
(50, 'Maison Dewey', 'Catherine Dewey', 'Rue Joseph-Bens 532', 'Bruxelles', 'B-1180', 'Belgium')
(51, 'Mère Paillarde', 'Jean Fresnière', '43 rue St. Laurent', 'Montréal', 'H1J 1C3', 'Canada')
(52, 'Morgenstern Gesundkost', 'Alexander Feuer', 'Heerstr. 22', 'Leipzig', '4179', 'Germany')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
(54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina')
(55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA')
...and 36 more rows.
Total rows (if limit is removed): 42
--------------------------------------------------

#### SQL INSERT INTO Statement

In [14]:
INSERT_INTO_query = ''' 
INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
'''
print_query(INSERT_INTO_query)

INSERT_INTO_query = ''' 
INSERT INTO Customers (CustomerName, City, Country)
VALUES ('Cardinal', 'Stavanger', 'Norway')
'''
print_query(INSERT_INTO_query)

# Insert Multiple Rows
INSERT_INTO_query = ''' 
INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES
('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway'),
('Greasy Burger', 'Per Olsen', 'Gateveien 15', 'Sandnes', '4306', 'Norway'),
('Tasty Tee', 'Finn Egan', 'Streetroad 19B', 'Liverpool', 'L1 0AA', 'UK')
'''
print_query(INSERT_INTO_query)

INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')

Query Results:
Total rows (if limit is removed): 0
--------------------------------------------------

INSERT INTO Customers (CustomerName, City, Country)
VALUES ('Cardinal', 'Stavanger', 'Norway')

Query Results:
Total rows (if limit is removed): 0
--------------------------------------------------

INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES
('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway'),
('Greasy Burger', 'Per Olsen', 'Gateveien 15', 'Sandnes', '4306', 'Norway'),
('Tasty Tee', 'Finn Egan', 'Streetroad 19B', 'Liverpool', 'L1 0AA', 'UK')

Query Results:
Total rows (if limit is removed): 0
--------------------------------------------------

#### SQL NULL Values

In [15]:
NULL_query = ''' 
SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NULL
'''
print_query(NULL_query)

NULL_query = ''' 
SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NOT NULL
'''
print_query(NULL_query)

SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NULL

Query Results:
('Cardinal', None, None)
Total rows (if limit is removed): 1
--------------------------------------------------

SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NOT NULL

Query Results:
('Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57')
('Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222')
('Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312')
('Around the Horn', 'Thomas Hardy', '120 Hanover Sq.')
('Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8')
('Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57')
...and 89 more rows.
Total rows (if limit is removed): 95
--------------------------------------------------

#### SQL UPDATE Statement

In [16]:
before_Update_query = ''' 
SELECT * 
FROM Customers
WHERE CustomerID = 1
'''
print_query(before_Update_query)

UPDATE_query = '''
UPDATE Customers
SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'
WHERE CustomerID = 1
'''
print_query(UPDATE_query)

after_Update_query = ''' 
SELECT * 
FROM Customers
WHERE CustomerID = 1
'''
print_query(after_Update_query)

SELECT *
FROM Customers
WHERE CustomerID = 1

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------

UPDATE Customers
SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'
WHERE CustomerID = 1

Query Results:
Total rows (if limit is removed): 0
--------------------------------------------------

SELECT *
FROM Customers
WHERE CustomerID = 1

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------

In [17]:
UPDATE_query = '''
UPDATE Customers
SET ContactName='Juan'
WHERE Country='Mexico'
'''
print(UPDATE_query)


# UPDATE_query = '''
# UPDATE Customers
# SET ContactName='Juan'
# '''
# print(UPDATE_query)

UPDATE Customers
SET ContactName='Juan'
WHERE Country='Mexico'

#### SQL DELETE Statement

In [18]:
before_Delete_query = ''' 
SELECT * FROM Customers
WHERE CustomerName = 'Alfreds Futterkiste'
'''
print_query(before_Delete_query)

after_Delete_query = ''' 
DELETE FROM Customers 
WHERE CustomerName = 'Alfreds Futterkiste'
'''
print(after_Delete_query)


# DELETE FROM Customers
# DROP TABLE Customers

SELECT * FROM Customers
WHERE CustomerName = 'Alfreds Futterkiste'

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------

DELETE FROM Customers
WHERE CustomerName = 'Alfreds Futterkiste'


                DELETE	            DROP TABLE
데이터 삭제 여부:	테이블의 데이터만 삭제	테이블과 데이터 모두 삭제

#### SQL TOP, LIMIT, FETCH FIRST or ROWNUM Clause

- SELECT TOP 절은 반환할 레코드의 최대 개수를 지정하는 데 사용
- Top은 SQLite에서 지원되지 않으므로, limit 사용

In [19]:
print_query("SELECT * FROM Customers LIMIT 3")
#print_query("SELECT TOP 3 * FROM Customers")

SELECT * FROM Customers LIMIT 3
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
Total rows (if limit is removed): 3
--------------------------------------------------

In [20]:
print_query("SELECT * FROM Customers LIMIT 3")

SELECT * FROM Customers LIMIT 3
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
Total rows (if limit is removed): 3
--------------------------------------------------

In [21]:
# Top Percent 바꿔서 진행해보기
TOP_query = ''' 
SELECT * FROM Customers
ORDER BY CustomerName
LIMIT (SELECT CAST(COUNT(*) * 0.5 AS INT) FROM Customers);
'''
print_query(TOP_query)

SELECT * FROM Customers
ORDER BY CustomerName
LIMIT (SELECT CAST(COUNT(*) * 0.5 AS INT) FROM Customers);

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
...and 42 more rows.
Total rows (if limit is removed): 48
--------------------------------------------------

In [22]:
TOP_query = ''' 
SELECT * FROM Customers
WHERE Country = 'Germany'
LIMIT 3
'''
print_query(TOP_query)

SELECT * FROM Customers
WHERE Country = 'Germany'
LIMIT 3

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
Total rows (if limit is removed): 3
--------------------------------------------------

In [23]:
print_query("SELECT * FROM Customers ORDER BY CustomerName DESC LIMIT 3;")

SELECT * FROM Customers ORDER BY CustomerName DESC LIMIT 3;
Query Results:
(91, 'Wolski', 'Zbyszek', 'ul. Filtrowa 68', 'Walla', '01-012', 'Poland')
(90, 'Wilman Kala', 'Matti Karttunen', 'Keskuskatu 45', 'Helsinki', '21240', 'Finland')
(89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA')
Total rows (if limit is removed): 3
--------------------------------------------------

#### SQL Aggregate Functions

#### SQL MIN() and MAX() Functions

In [24]:
print_query("SELECT MIN(Price) FROM Products")

SELECT MIN(Price) FROM Products
Query Results:
(2.5,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [25]:
print_query("SELECT MAX(Price) FROM Products")

SELECT MAX(Price) FROM Products
Query Results:
(263.5,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [26]:
print_query("SELECT MIN(Price) AS SmallestPrice FROM Products")

SELECT MIN(Price) AS SmallestPrice FROM Products
Query Results:
(2.5,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [27]:
# 그룹별로 가장 작은 값을 구한 것
print_query("SELECT MIN(Price) AS SmallestPrice, CategoryID FROM Products GROUP BY CategoryID")

SELECT MIN(Price) AS SmallestPrice, CategoryID FROM Products GROUP BY CategoryID
Query Results:
(4.5, 1)
(10, 2)
(9.2, 3)
(2.5, 4)
(7, 5)
(7.45, 6)
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------

#### SQL COUNT() Function

In [28]:
# 6줄만 나오도록 제한
def print_query(query, limit=6):
    cur.execute(query)
    print(query)
    i = 0
    for row in cur:
        if i >= limit:
            print('...')
            break
        print(row)
        i += 1
    print('-' * 50)

print_query("SELECT COUNT(*) FROM Products")
print_query("SELECT COUNT(ProductName) FROM Products")
print_query("SELECT COUNT(ProductID) FROM Products WHERE Price > 20")
print_query("SELECT COUNT(DISTINCT Price) FROM Products")
print_query("SELECT COUNT(*) AS [Number of records] FROM Products")
print_query("SELECT COUNT(*) AS [Number of records], CategoryID FROM Products GROUP BY CategoryID")

SELECT COUNT(*) FROM Products
(77,)
--------------------------------------------------
SELECT COUNT(ProductName) FROM Products
(77,)
--------------------------------------------------
SELECT COUNT(ProductID) FROM Products WHERE Price > 20
(37,)
--------------------------------------------------
SELECT COUNT(DISTINCT Price) FROM Products
(62,)
--------------------------------------------------
SELECT COUNT(*) AS [Number of records] FROM Products
(77,)
--------------------------------------------------
SELECT COUNT(*) AS [Number of records], CategoryID FROM Products GROUP BY CategoryID
(12, 1)
(12, 2)
(13, 3)
(10, 4)
(7, 5)
(6, 6)
...
--------------------------------------------------

In [29]:
def print_query(query, limit=6):
    print(query)
    """Execute a query and print the result with an optional limit."""
    cur.execute(query)
    results = cur.fetchall()
    
    # 프린트 줄의 제한
    print("Query Results:")
    for idx, row in enumerate(results):
        if idx >= limit:
            print(f"...and {len(results) - limit} more rows.")
            break
        print(row)
    
    # Calculate and print the total rows if no limit is applied
    if limit:
        print(f"Total rows (if limit is removed): {len(results)}")
    
    print('-' * 50)

#### SQL SUM() Function

In [30]:
print_query("SELECT SUM(Quantity) FROM OrderDetails")

SELECT SUM(Quantity) FROM OrderDetails
Query Results:
(12743,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [31]:
print_query("SELECT SUM(Quantity) FROM OrderDetails WHERE ProductID = 11")

SELECT SUM(Quantity) FROM OrderDetails WHERE ProductID = 11
Query Results:
(182,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [32]:
print_query("SELECT SUM(Quantity) AS total FROM OrderDetails")

SELECT SUM(Quantity) AS total FROM OrderDetails
Query Results:
(12743,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [33]:
print_query("SELECT OrderID, SUM(Quantity) AS [Total Quantity] FROM OrderDetails GROUP BY OrderID")

SELECT OrderID, SUM(Quantity) AS [Total Quantity] FROM OrderDetails GROUP BY OrderID
Query Results:
(10248, 27)
(10249, 49)
(10250, 60)
(10251, 41)
(10252, 105)
(10253, 102)
...and 190 more rows.
Total rows (if limit is removed): 196
--------------------------------------------------

In [34]:
print_query("SELECT SUM(Quantity * 10) FROM OrderDetails")
print_query("SELECT SUM(Quantity) FROM OrderDetails")

SELECT SUM(Quantity * 10) FROM OrderDetails
Query Results:
(127430,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT SUM(Quantity) FROM OrderDetails
Query Results:
(12743,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [35]:
print_query("SELECT SUM(Price * Quantity) FROM OrderDetails LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID")

SELECT SUM(Price * Quantity) FROM OrderDetails LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID
Query Results:
(386424.23,)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL AVG() Function

In [36]:
print_query("SELECT AVG(Price) FROM Products")
print_query("SELECT AVG(Price) FROM Products WHERE CategoryID = 1")
print_query("SELECT AVG(Price) AS [average price] FROM Products")

SELECT AVG(Price) FROM Products
Query Results:
(28.866363636363637,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT AVG(Price) FROM Products WHERE CategoryID = 1
Query Results:
(37.979166666666664,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT AVG(Price) AS [average price] FROM Products
Query Results:
(28.866363636363637,)
Total rows (if limit is removed): 1
--------------------------------------------------

In [37]:
print_query("SELECT * FROM Products WHERE price > (SELECT AVG(price) FROM Products)")

SELECT * FROM Products WHERE price > (SELECT AVG(price) FROM Products)
Query Results:
(7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30)
(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
(10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)
(12, 'Queso Manchego La Pastora', 5, 4, '10 - 500 g pkgs.', 38)
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
...and 19 more rows.
Total rows (if limit is removed): 25
--------------------------------------------------

In [38]:
print_query("SELECT AVG(Price) AS AveragePrice, CategoryID FROM Products GROUP BY CategoryID")

SELECT AVG(Price) AS AveragePrice, CategoryID FROM Products GROUP BY CategoryID
Query Results:
(37.979166666666664, 1)
(23.0625, 2)
(25.16, 3)
(28.73, 4)
(20.25, 5)
(54.00666666666667, 6)
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------

#### SQL LIKE Operator

In [39]:
print_query("SELECT * FROM  Customers WHERE CustomerName LIKE 'a%'")

SELECT * FROM  Customers WHERE CustomerName LIKE 'a%'
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
Total rows (if limit is removed): 4
--------------------------------------------------

In [40]:
print_query("SELECT * FROM Customers WHERE city LIKE 'L_nd__'")

SELECT * FROM Customers WHERE city LIKE 'L_nd__'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
(19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
(72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')
...and 1 more rows.
Total rows (if limit is removed): 7
--------------------------------------------------

In [41]:
print_query("SELECT * FROM Customers WHERE city LIKE '%L%'")
# L이 포함된 모든 것

SELECT * FROM Customers WHERE city LIKE '%L%'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(9, "Bon app''", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
...and 35 more rows.
Total rows (if limit is removed): 41
--------------------------------------------------

In [42]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'La%'")

SELECT * FROM Customers WHERE CustomerName LIKE 'La%'
Query Results:
(40, "La corne d''abondance", 'Daniel Tonini', "67, avenue de l''Europe", 'Versailles', '78000', 'France')
(41, "La maison d''Asie", 'Annette Roulet', '1 rue Alsace-Lorraine', 'Toulouse', '31000', 'France')
(42, 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', '1900 Oak St.', 'Vancouver', 'V3F 2K1', 'Canada')
(43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA')
Total rows (if limit is removed): 4
--------------------------------------------------

In [43]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'a%' OR CustomerName LIKE 'b%'")

SELECT * FROM Customers WHERE CustomerName LIKE 'a%' OR CustomerName LIKE 'b%'
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 5 more rows.
Total rows (if limit is removed): 11
--------------------------------------------------

In [44]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE '%a'")

SELECT * FROM Customers WHERE CustomerName LIKE '%a'
Query Results:
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil')
(62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil')
(88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil')
...and 1 more rows.
Total rows (if limit is removed): 7
--------------------------------------------------

In [45]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'b%s'")

SELECT * FROM Customers WHERE CustomerName LIKE 'b%s'
Query Results:
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
Total rows (if limit is removed): 3
--------------------------------------------------

In [46]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE '%or%'")

SELECT * FROM Customers WHERE CustomerName LIKE '%or%'
Query Results:
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')
(40, "La corne d''abondance", 'Daniel Tonini', "67, avenue de l''Europe", 'Versailles', '78000', 'France')
(43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA')
(52, 'Morgenstern Gesundkost', 'Alexander Feuer', 'Heerstr. 22', 'Leipzig', '4179', 'Germany')
...and 5 more rows.
Total rows (if limit is removed): 11
--------------------------------------------------

In [47]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'a___%'")
# 3글자 이상

print_query("SELECT * FROM Customers WHERE CustomerName LIKE '_r%'")
# 2번째에 r

SELECT * FROM Customers WHERE CustomerName LIKE 'a___%'
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
Total rows (if limit is removed): 4
--------------------------------------------------
SELECT * FROM Customers WHERE CustomerName LIKE '_r%'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
(20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria')
(25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany')
(26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', '44000', 'France')
(27, 'Franchi S.p.A.', 'Paolo Accorti', 'Via Monte Bianco 34', 'Torino', '10100', 'Italy')
...and 6 more rows.
Total rows (if limit is removed): 12
--------------------------------------------------

In [48]:
print_query("SELECT * FROM Customers WHERE Country LIKE 'Spain'")

SELECT * FROM Customers WHERE Country LIKE 'Spain'
Query Results:
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
Total rows (if limit is removed): 5
--------------------------------------------------

#### SQL Wildcards

In [49]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'a%'")

SELECT * FROM Customers WHERE CustomerName LIKE 'a%'
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
Total rows (if limit is removed): 4
--------------------------------------------------

In [50]:
print_query("SELECT * FROM Customers WHERE CustomerName LIKE '%es'")
print_query("SELECT * FROM Customers WHERE CustomerName LIKE '%mer%'")

SELECT * FROM Customers WHERE CustomerName LIKE '%es'
Query Results:
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(23, 'Folies gourmandes', 'Martine Rancé', '184, chaussée de Tournai', 'Lille', '59000', 'France')
(31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil')
(34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil')
(47, 'LINO-Delicateses', 'Felipe Izquierdo', 'Ave. 5 de Mayo Porlamar', 'I. de Margarita', '4980', 'Venezuela')
(76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium')
Total rows (if limit is removed): 6
--------------------------------------------------
SELECT * FROM Customers WHERE CustomerName LIKE '%mer%'
Query Results:
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(46, 'LILA-Supermercado', 'Carlos González', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', '3508', 'Venezuela')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
(81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil')
Total rows (if limit is removed): 4
--------------------------------------------------

In [51]:
print_query("SELECT * FROM Customers WHERE City LIKE '_ondon'")

SELECT * FROM Customers WHERE City LIKE '_ondon'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
(19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
(72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')
Total rows (if limit is removed): 6
--------------------------------------------------

In [52]:
print_query("SELECT * FROM Customers WHERE City LIKE 'L___on'")

SELECT * FROM Customers WHERE City LIKE 'L___on'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
(19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
(72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')
Total rows (if limit is removed): 6
--------------------------------------------------

In [53]:
#print_query("SELECT * FROM Customers WHERE CustomerName LIKE '[bsp]%'")
#print_query("SELECT * FROM Customers WHERE CustomerName LIKE '[a-f]%'")
print_query("SELECT * FROM Customers WHERE CustomerName LIKE 'a__%'")
print_query("SELECT * FROM Customers WHERE CustomerName LIKE '_r%'")
print_query("SELECT * FROM Customers WHERE Country LIKE 'Spain'")

SELECT * FROM Customers WHERE CustomerName LIKE 'a__%'
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
Total rows (if limit is removed): 4
--------------------------------------------------
SELECT * FROM Customers WHERE CustomerName LIKE '_r%'
Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
(20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria')
(25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany')
(26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', '44000', 'France')
(27, 'Franchi S.p.A.', 'Paolo Accorti', 'Via Monte Bianco 34', 'Torino', '10100', 'Italy')
...and 6 more rows.
Total rows (if limit is removed): 12
--------------------------------------------------
SELECT * FROM Customers WHERE Country LIKE 'Spain'
Query Results:
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
Total rows (if limit is removed): 5
--------------------------------------------------

#### SQL IN Operator

In [54]:
print_query("SELECT * FROM Customers WHERE Country IN ('Germany', 'France', 'UK')")
print_query("SELECT * FROM Customers WHERE Country NOT IN ('Germany', 'France', 'UK')")

SELECT * FROM Customers WHERE Country IN ('Germany', 'France', 'UK')
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(9, "Bon app''", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
...and 24 more rows.
Total rows (if limit is removed): 30
--------------------------------------------------
SELECT * FROM Customers WHERE Country NOT IN ('Germany', 'France', 'UK')
Query Results:
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada')
(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina')
...and 60 more rows.
Total rows (if limit is removed): 66
--------------------------------------------------

In [55]:
print_query("SELECT * FROM Customers WHERE CustomerID IN (SELECT CustomerID FROM Orders)")
print_query("SELECT * FROM Customers WHERE CustomerID NOT IN (SELECT CustomerID FROM Orders)")

SELECT * FROM Customers WHERE CustomerID IN (SELECT CustomerID FROM Orders)
Query Results:
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
...and 68 more rows.
Total rows (if limit is removed): 74
--------------------------------------------------
SELECT * FROM Customers WHERE CustomerID NOT IN (SELECT CustomerID FROM Orders)
Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', '44000', 'France')
(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA')
...and 16 more rows.
Total rows (if limit is removed): 22
--------------------------------------------------

#### SQL BETWEEN Operator

In [56]:
print_query("SELECT * FROM Products WHERE Price BETWEEN 10 AND 20")
print_query("SELECT * FROM Products WHERE Price NOT BETWEEN 10 AND 20")

SELECT * FROM Products WHERE Price BETWEEN 10 AND 20
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 15.5)
(16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17.45)
(21, "Sir Rodney's Scones", 8, 3, '24 pkgs. x 4 pieces', 10)
...and 23 more rows.
Total rows (if limit is removed): 29
--------------------------------------------------
SELECT * FROM Products WHERE Price NOT BETWEEN 10 AND 20
Query Results:
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
(6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25)
(7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30)
(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
...and 42 more rows.
Total rows (if limit is removed): 48
--------------------------------------------------

In [57]:
print_query("SELECT * FROM Products WHERE Price BETWEEN 10 AND 20 AND CategoryID IN (1, 4, 3)")

SELECT * FROM Products WHERE Price BETWEEN 10 AND 20 AND CategoryID IN (1, 4, 3)
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17.45)
(21, "Sir Rodney's Scones", 8, 3, '24 pkgs. x 4 pieces', 10)
(25, 'NuNuCa Nuß-Nougat-Creme', 11, 3, '20 - 450 g glasses', 14)
(31, 'Gorgonzola Telino', 14, 4, '12 - 100 g pkgs', 12.5)
...and 10 more rows.
Total rows (if limit is removed): 16
--------------------------------------------------

In [58]:
print_query("SELECT * FROM Products WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni' ORDER BY ProductName")

SELECT * FROM Products WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni' ORDER BY ProductName
Query Results:
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
...and 31 more rows.
Total rows (if limit is removed): 37
--------------------------------------------------

In [59]:
query = ''' 
SELECT * FROM Products
WHERE ProductName BETWEEN "Carnarvon Tigers" AND "Chef Anton's Cajun Seasoning"
ORDER BY ProductName
'''
print_query(query)

SELECT * FROM Products
WHERE ProductName BETWEEN "Carnarvon Tigers" AND "Chef Anton's Cajun Seasoning"
ORDER BY ProductName

Query Results:
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
Total rows (if limit is removed): 5
--------------------------------------------------

In [60]:
query = ''' 
SELECT * FROM Products
WHERE ProductName NOT BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
ORDER BY ProductName
'''
print_query(query)

SELECT * FROM Products
WHERE ProductName NOT BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
ORDER BY ProductName

Query Results:
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4)
(60, 'Camembert Pierrot', 28, 4, '15 - 300 g rounds', 34)
(30, 'Nord-Ost Matjeshering', 13, 8, '10 - 200 g glasses', 25.89)
(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40)
...and 34 more rows.
Total rows (if limit is removed): 40
--------------------------------------------------

In [61]:
# query = ''' 
# SELECT * FROM Orders
# WHERE OrderDate BETWEEN #07/01/1996# AND #07/31/1996#
# '''

query = ''' 
SELECT * FROM Orders
WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31'
'''
print_query(query)

SELECT * FROM Orders
WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31'

Query Results:
(10248, 90, 5, '1996-07-04', 3)
(10249, 81, 6, '1996-07-05', 1)
(10250, 34, 4, '1996-07-08', 2)
(10251, 84, 3, '1996-07-08', 1)
(10252, 76, 4, '1996-07-09', 2)
(10253, 34, 3, '1996-07-10', 2)
...and 16 more rows.
Total rows (if limit is removed): 22
--------------------------------------------------

#### SQL Aliases

In [62]:
query = ''' 
SELECT CustomerID AS ID
FROM Customers
'''
print_query(query)

SELECT CustomerID AS ID
FROM Customers

Query Results:
(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
...and 90 more rows.
Total rows (if limit is removed): 96
--------------------------------------------------

In [63]:
# 생략가능
query = ''' 
SELECT CustomerID ID
FROM Customers
'''
print_query(query)

SELECT CustomerID ID
FROM Customers

Query Results:
(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
...and 90 more rows.
Total rows (if limit is removed): 96
--------------------------------------------------

In [64]:
query = ''' 
SELECT CustomerID AS ID, CustomerName AS Customer
FROM Customers
'''
print_query(query)

SELECT CustomerID AS ID, CustomerName AS Customer
FROM Customers

Query Results:
(1, 'Alfreds Futterkiste')
(2, 'Ana Trujillo Emparedados y helados')
(3, 'Antonio Moreno Taquería')
(4, 'Around the Horn')
(5, 'Berglunds snabbköp')
(6, 'Blauer See Delikatessen')
...and 90 more rows.
Total rows (if limit is removed): 96
--------------------------------------------------

In [65]:
query = ''' 
SELECT ProductName AS [My Great Products]
FROM Products
'''
print_query(query)

query = ''' 
SELECT ProductName AS "My Great Products"
FROM Products;
'''
print_query(query)

SELECT ProductName AS [My Great Products]
FROM Products

Query Results:
('Chais',)
('Chang',)
('Aniseed Syrup',)
("Chef Anton's Cajun Seasoning",)
("Chef Anton's Gumbo Mix",)
("Grandma's Boysenberry Spread",)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

SELECT ProductName AS "My Great Products"
FROM Products;

Query Results:
('Chais',)
('Chang',)
('Aniseed Syrup',)
("Chef Anton's Cajun Seasoning",)
("Chef Anton's Gumbo Mix",)
("Grandma's Boysenberry Spread",)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [66]:
query = ''' 
SELECT CustomerName, Address = ', ' + PostalCode + ' ' + City + ', ' + Country AS Address
FROM Customers
'''
print_query(query)

SELECT CustomerName, Address = ', ' + PostalCode + ' ' + City + ', ' + Country AS Address
FROM Customers

Query Results:
('Alfreds Futterkiste', 0)
('Ana Trujillo Emparedados y helados', 0)
('Antonio Moreno Taquería', 0)
('Around the Horn', 0)
('Berglunds snabbköp', 0)
('Blauer See Delikatessen', 0)
...and 90 more rows.
Total rows (if limit is removed): 96
--------------------------------------------------

In [67]:
# Alias for Tables
query = ''' 
SELECT * FROM Customers AS Persons;
'''
print_query(query)

SELECT * FROM Customers AS Persons;

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 90 more rows.
Total rows (if limit is removed): 96
--------------------------------------------------

In [68]:
query = ''' 
SELECT o.OrderID, o.OrderDate, c.CustomerName
FROM Customers AS c, Orders AS o
WHERE c.CustomerName='Around the Horn' AND c.CustomerID=o.CustomerID
'''
print_query(query)


query = ''' 
SELECT Orders.OrderID, Orders.OrderDate, Customers.CustomerName
FROM Customers, Orders
WHERE Customers.CustomerName='Around the Horn' AND Customers.CustomerID=Orders.CustomerID
'''
print_query(query)

SELECT o.OrderID, o.OrderDate, c.CustomerName
FROM Customers AS c, Orders AS o
WHERE c.CustomerName='Around the Horn' AND c.CustomerID=o.CustomerID

Query Results:
(10355, '1996-11-15', 'Around the Horn')
(10383, '1996-12-16', 'Around the Horn')
Total rows (if limit is removed): 2
--------------------------------------------------

SELECT Orders.OrderID, Orders.OrderDate, Customers.CustomerName
FROM Customers, Orders
WHERE Customers.CustomerName='Around the Horn' AND Customers.CustomerID=Orders.CustomerID

Query Results:
(10355, '1996-11-15', 'Around the Horn')
(10383, '1996-12-16', 'Around the Horn')
Total rows (if limit is removed): 2
--------------------------------------------------

#### SQL Joins

In [69]:
query = ''' 
SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
FROM Orders
INNER JOIN Customers
ON Orders.CustomerID=Customers.CustomerID
'''
print_query(query)

SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
FROM Orders
INNER JOIN Customers
ON Orders.CustomerID=Customers.CustomerID

Query Results:
(10248, 'Wilman Kala', '1996-07-04')
(10249, 'Tradição Hipermercados', '1996-07-05')
(10250, 'Hanari Carnes', '1996-07-08')
(10251, 'Victuailles en stock', '1996-07-08')
(10252, 'Suprêmes délices', '1996-07-09')
(10253, 'Hanari Carnes', '1996-07-10')
...and 190 more rows.
Total rows (if limit is removed): 196
--------------------------------------------------

#### SQL INNER JOIN

In [70]:
query = ''' 
SELECT ProductID, ProductName, CategoryName
FROM Products
INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID
'''
print_query(query)

SELECT ProductID, ProductName, CategoryName
FROM Products
INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID

Query Results:
(1, 'Chais', 'Beverages')
(2, 'Chang', 'Beverages')
(3, 'Aniseed Syrup', 'Condiments')
(4, "Chef Anton's Cajun Seasoning", 'Condiments')
(5, "Chef Anton's Gumbo Mix", 'Condiments')
(6, "Grandma's Boysenberry Spread", 'Condiments')
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [71]:
query = ''' 
SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
FROM Products
INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID
'''
print_query(query)

SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
FROM Products
INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID

Query Results:
(1, 'Chais', 'Beverages')
(2, 'Chang', 'Beverages')
(3, 'Aniseed Syrup', 'Condiments')
(4, "Chef Anton's Cajun Seasoning", 'Condiments')
(5, "Chef Anton's Gumbo Mix", 'Condiments')
(6, "Grandma's Boysenberry Spread", 'Condiments')
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [72]:
# JOIN and INNER JOIN will return the same result
query = ''' 
SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
FROM Products
JOIN Categories ON Products.CategoryID = Categories.CategoryID
'''
print_query(query)


query = ''' 
SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
FROM ((Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID) INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID)
'''
print_query(query)

SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
FROM Products
JOIN Categories ON Products.CategoryID = Categories.CategoryID

Query Results:
(1, 'Chais', 'Beverages')
(2, 'Chang', 'Beverages')
(3, 'Aniseed Syrup', 'Condiments')
(4, "Chef Anton's Cajun Seasoning", 'Condiments')
(5, "Chef Anton's Gumbo Mix", 'Condiments')
(6, "Grandma's Boysenberry Spread", 'Condiments')
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
FROM ((Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID) INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID)

Query Results:
(10248, 'Wilman Kala', 'Federal Shipping')
(10249, 'Tradição Hipermercados', 'Speedy Express')
(10250, 'Hanari Carnes', 'United Package')
(10251, 'Victuailles en stock', 'Speedy Express')
(10252, 'Suprêmes délices', 'United Package')
(10253, 'Hanari Carnes', 'United Package')
...and 190 more rows.
Total rows (if limit is removed): 196
--------------------------------------------------

#### SQL LEFT JOIN Keyword

In [73]:
query = ''' 
SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerName
'''
print_query(query)

SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerName

Query Results:
('Alfreds Futterkiste', None)
('Ana Trujillo Emparedados y helados', 10308)
('Antonio Moreno Taquería', 10365)
('Around the Horn', 10355)
('Around the Horn', 10383)
("B''s Beverages", 10289)
...and 212 more rows.
Total rows (if limit is removed): 218
--------------------------------------------------

#### SQL RIGHT JOIN Keyword

In [74]:
# SQLite3은 RIGHT JOIN을 지원하지 않습니다.

query = ''' 
SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders
RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID
'''
print_query(query)

SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders
RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID

Query Results:
(None, 'West', 'Adam')
(10248, 'Buchanan', 'Steven')
(10249, 'Suyama', 'Michael')
(10250, 'Peacock', 'Margaret')
(10251, 'Leverling', 'Janet')
(10252, 'Peacock', 'Margaret')
...and 191 more rows.
Total rows (if limit is removed): 197
--------------------------------------------------

#### SQL FULL OUTER JOIN Keyword

In [75]:
query = ''' 
SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName
'''
print_query(query)

SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName

Query Results:
('Alfreds Futterkiste', None)
('Ana Trujillo Emparedados y helados', 10308)
('Antonio Moreno Taquería', 10365)
('Around the Horn', 10355)
('Around the Horn', 10383)
("B''s Beverages", 10289)
...and 212 more rows.
Total rows (if limit is removed): 218
--------------------------------------------------

#### SQL Self Join

In [76]:
# <>는 같지 않다는 것
# 같은 테이블을 사용하므로 별칭 사용
query = ''' 
SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
FROM Customers A, Customers B 
WHERE A.CustomerID <> B.CustomerID AND A.City = B.City
ORDER BY A.City
'''
print_query(query)

SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
FROM Customers A, Customers B
WHERE A.CustomerID <> B.CustomerID AND A.City = B.City
ORDER BY A.City

Query Results:
('Cactus Comidas para llevar', 'Océano Atlántico Ltda.', 'Buenos Aires')
('Cactus Comidas para llevar', 'Rancho grande', 'Buenos Aires')
('Océano Atlántico Ltda.', 'Cactus Comidas para llevar', 'Buenos Aires')
('Océano Atlántico Ltda.', 'Rancho grande', 'Buenos Aires')
('Rancho grande', 'Cactus Comidas para llevar', 'Buenos Aires')
('Rancho grande', 'Océano Atlántico Ltda.', 'Buenos Aires')
...and 88 more rows.
Total rows (if limit is removed): 94
--------------------------------------------------

#### SQL UNION Operator

In [77]:
query = ''' 
SELECT City FROM Customers
UNION
SELECT City FROM Suppliers
ORDER BY City
'''
print_query(query)

SELECT City FROM Customers
UNION
SELECT City FROM Suppliers
ORDER BY City

Query Results:
('Aachen',)
('Albuquerque',)
('Anchorage',)
('Ann Arbor',)
('Annecy',)
('Barcelona',)
...and 91 more rows.
Total rows (if limit is removed): 97
--------------------------------------------------

In [78]:
# 중복 포함
query = ''' 
SELECT City FROM Customers
UNION ALL
SELECT City FROM Suppliers
ORDER BY City
'''
print_query(query)

SELECT City FROM Customers
UNION ALL
SELECT City FROM Suppliers
ORDER BY City

Query Results:
('Aachen',)
('Albuquerque',)
('Anchorage',)
('Ann Arbor',)
('Annecy',)
('Barcelona',)
...and 119 more rows.
Total rows (if limit is removed): 125
--------------------------------------------------

In [79]:
query = ''' 
SELECT City, Country FROM Customers
WHERE Country = 'Germany'
UNION
SELECT City, Country FROM Suppliers
WHERE Country = 'Germany'
ORDER BY City
'''
print_query(query)

SELECT City, Country FROM Customers
WHERE Country = 'Germany'
UNION
SELECT City, Country FROM Suppliers
WHERE Country = 'Germany'
ORDER BY City

Query Results:
('Aachen', 'Germany')
('Berlin', 'Germany')
('Brandenburg', 'Germany')
('Cunewalde', 'Germany')
('Cuxhaven', 'Germany')
('Frankfurt', 'Germany')
...and 7 more rows.
Total rows (if limit is removed): 13
--------------------------------------------------

In [80]:
query = ''' 
SELECT City, Country FROM Customers
WHERE Country = 'Germany'
UNION ALL
SELECT City, Country FROM Suppliers
WHERE Country = 'Germany'
ORDER BY City
'''
print_query(query)

SELECT City, Country FROM Customers
WHERE Country = 'Germany'
UNION ALL
SELECT City, Country FROM Suppliers
WHERE Country = 'Germany'
ORDER BY City

Query Results:
('Aachen', 'Germany')
('Berlin', 'Germany')
('Brandenburg', 'Germany')
('Cunewalde', 'Germany')
('Cuxhaven', 'Germany')
('Frankfurt', 'Germany')
...and 8 more rows.
Total rows (if limit is removed): 14
--------------------------------------------------

In [81]:
query = ''' 
SELECT 'Customer' AS Type, ContactName, City, Country
FROM Customers
UNION
SELECT 'Supplier', ContactName, City, Country
FROM Suppliers
'''
print_query(query)

SELECT 'Customer' AS Type, ContactName, City, Country
FROM Customers
UNION
SELECT 'Supplier', ContactName, City, Country
FROM Suppliers

Query Results:
('Customer', None, 'Stavanger', 'Norway')
('Customer', 'Alejandra Camino', 'Madrid', 'Spain')
('Customer', 'Alexander Feuer', 'Leipzig', 'Germany')
('Customer', 'Alfred Schmidt', 'Frankfurt', 'Germany')
('Customer', 'Ana Trujillo', 'México D.F.', 'Mexico')
('Customer', 'Anabela Domingues', 'São Paulo', 'Brazil')
...and 118 more rows.
Total rows (if limit is removed): 124
--------------------------------------------------

#### SQL GROUP BY Statement

In [82]:
query = ''' 
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
'''
print_query(query)

SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country

Query Results:
(3, 'Argentina')
(2, 'Austria')
(2, 'Belgium')
(9, 'Brazil')
(3, 'Canada')
(2, 'Denmark')
...and 15 more rows.
Total rows (if limit is removed): 21
--------------------------------------------------

In [83]:
query = ''' 
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC
'''
print_query(query)

SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC

Query Results:
(13, 'USA')
(11, 'Germany')
(11, 'France')
(9, 'Brazil')
(8, 'UK')
(5, 'Spain')
...and 15 more rows.
Total rows (if limit is removed): 21
--------------------------------------------------

In [84]:
query = ''' 
SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders 
FROM Orders
LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
GROUP BY ShipperName
'''
print_query(query)

SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders
FROM Orders
LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
GROUP BY ShipperName

Query Results:
('Federal Shipping', 68)
('Speedy Express', 54)
('United Package', 74)
Total rows (if limit is removed): 3
--------------------------------------------------

#### SQL HAVING Clause

In [85]:
query = ''' 
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
'''
print_query(query)

SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5

Query Results:
(9, 'Brazil')
(11, 'France')
(11, 'Germany')
(8, 'UK')
(13, 'USA')
Total rows (if limit is removed): 5
--------------------------------------------------

In [86]:
query = ''' 
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
ORDER BY COUNT(CustomerID) DESC
'''
print_query(query)

SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
ORDER BY COUNT(CustomerID) DESC

Query Results:
(13, 'USA')
(11, 'Germany')
(11, 'France')
(9, 'Brazil')
(8, 'UK')
Total rows (if limit is removed): 5
--------------------------------------------------

In [87]:
query = ''' 
SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
FROM (Orders INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID)
GROUP BY LastName
HAVING COUNT(Orders.OrderID) > 10
'''
print_query(query)

SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
FROM (Orders INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID)
GROUP BY LastName
HAVING COUNT(Orders.OrderID) > 10

Query Results:
('Buchanan', 11)
('Callahan', 27)
('Davolio', 29)
('Fuller', 20)
('King', 14)
('Leverling', 31)
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------

In [88]:
query = ''' 
SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
FROM Orders 
INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
WHERE LastName = 'Davolio' OR LastName = 'Fuller'
GROUP BY LastName
HAVING COUNT(Orders.OrderID) > 25
'''
print_query(query)

SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
FROM Orders
INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
WHERE LastName = 'Davolio' OR LastName = 'Fuller'
GROUP BY LastName
HAVING COUNT(Orders.OrderID) > 25

Query Results:
('Davolio', 29)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL EXISTS Operator

In [89]:
query = ''' 
SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20)
'''
print_query(query)

SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20)

Query Results:
('Exotic Liquid',)
('New Orleans Cajun Delights',)
('Tokyo Traders',)
("Mayumi's",)
('Pavlova, Ltd.',)
('Specialty Biscuits, Ltd.',)
...and 18 more rows.
Total rows (if limit is removed): 24
--------------------------------------------------

In [90]:
query = ''' 
SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price = 22)'''
print_query(query)

SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price = 22)
Query Results:
('New Orleans Cajun Delights',)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL ANY and ALL Operators

In [91]:
#SQLite3는 ANY와 ALL 연산자를 기본적으로 지원하지 않습니다

# query = ''' 
# SELECT ProductName
# FROM Products
# WHERE ProductID = ANY
#   (SELECT ProductID
#   FROM OrderDetails
#   WHERE Quantity = 10)
# '''
# print_query(query)

# query = ''' 
# SELECT ProductName
# FROM Products
# WHERE ProductID = ANY
#   (SELECT ProductID
#   FROM OrderDetails
#   WHERE Quantity > 1000)
# '''
# print_query(query)

# query = ''' 
# SELECT ProductName
# FROM Products
# WHERE ProductID = ALL
#   (SELECT ProductID
#   FROM OrderDetails
#   WHERE Quantity = 10)
# '''  
# print_query(query)

#### SQL SELECT INTO Statement

In [92]:
# SQLite는 SELECT INTO를 지원하지 않습니다. 
# 대신, CREATE TABLE ... AS 구문을 사용하여 동일한 작업을 수행할 수 있습니다.

In [93]:
# CREATE TABLE CustomersBackup AS
# SELECT *
# FROM Customers;

# CREATE TABLE CustomersMinimalBackup AS
# SELECT CustomerName, Country
# FROM Customers;

# CREATE TABLE CustomersGermany AS
# SELECT *
# FROM Customers
# WHERE Country = 'Germany';

#### SQL INSERT INTO SELECT Statement

In [94]:
query = ''' 
INSERT INTO Customers (CustomerName, City, Country)
SELECT SupplierName, City, Country FROM Suppliers
'''
print_query(query)


query = ''' 
INSERT INO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
SELECT SupplierName, ContactName, Address, City, PostalCode, Country FROM Suppliers
'''

query = '''
INSERT INTO Customers (CustomerName, City, Country)
SELECT SupplierName, City, Country FROM Suppliers
WHERE Country='Germany
'''

INSERT INTO Customers (CustomerName, City, Country)
SELECT SupplierName, City, Country FROM Suppliers

Query Results:
Total rows (if limit is removed): 0
--------------------------------------------------

#### SQL CASE Expression

In [95]:
query = '''
SELECT OrderID, Quantity,
CASE
    WHEN Quantity > 30 THEN 'The quantity is greater than 30'
    WHEN Quantity = 30 THEN 'The quantity is 30'
    ELSE 'The quantity is under 30'
END AS QuantityText
FROM OrderDetails
'''

print_query(query)

SELECT OrderID, Quantity,
CASE
    WHEN Quantity > 30 THEN 'The quantity is greater than 30'
    WHEN Quantity = 30 THEN 'The quantity is 30'
    ELSE 'The quantity is under 30'
END AS QuantityText
FROM OrderDetails

Query Results:
(10248, 12, 'The quantity is under 30')
(10248, 10, 'The quantity is under 30')
(10248, 5, 'The quantity is under 30')
(10249, 9, 'The quantity is under 30')
(10249, 40, 'The quantity is greater than 30')
(10250, 10, 'The quantity is under 30')
...and 512 more rows.
Total rows (if limit is removed): 518
--------------------------------------------------

In [96]:
query = '''
SELECT CustomerName, City, Country
FROM Customers
ORDER BY
(CASE
    WHEN City IS NULL THEN Country
    ELSE City
END)
'''

print_query(query)

SELECT CustomerName, City, Country
FROM Customers
ORDER BY
(CASE
    WHEN City IS NULL THEN Country
    ELSE City
END)

Query Results:
('Drachenblut Delikatessend', 'Aachen', 'Germany')
('Rattlesnake Canyon Grocery', 'Albuquerque', 'USA')
('Old World Delicatessen', 'Anchorage', 'USA')
("Grandma Kelly's Homestead", 'Ann Arbor', 'USA')
('Gai pâturage', 'Annecy', 'France')
('Galería del gastrónomo', 'Barcelona', 'Spain')
...and 119 more rows.
Total rows (if limit is removed): 125
--------------------------------------------------

#### SQL NULL Functions

In [97]:
# IFNULL()
query = ''' 
SELECT ProductName, UnitPrice * (UnitsInStock + IFNULL(UnitsOnOrder, 0))
FROM Products;
'''

# COALESCE() 여러 값 중 첫 번째로 NULL이 아닌 값을 반환합니다.
query = ''' 
SELECT ProductName, UnitPrice * (UnitsInStock + COALESCE(UnitsOnOrder, 0))
FROM Products;
'''

#### SQL Stored Procedures for SQL Server

In [98]:
# # 저장 프로시저 생성
# print_query("CREATE PROCEDURE SelectAllCustomers AS SELECT * FROM Customers GO")
# # 저장 프로시저 실행
# print_query("EXEC SelectAllCustomers")


# # 저장 프로시저 생성
# print_query("CCREATE PROCEDURE SelectAllCustomers @City nvarchar(30), @PostalCode nvarchar(10) AS SELECT * FROM Customers WHERE City = @City AND PostalCode = @PostalCode GO")
# # 저장 프로시저 실행
# print_query("EXEC SelectAllCustomers @City = 'London', @PostalCode = 'WA1 1DP'")


# # 저장 프로시저 생성
# print_query("CREATE PROCEDURE SelectAllCustomers @City nvarchar(30) AS SELECT * FROM Customers WHERE City = @City GO")
# # 저장 프로시저 실행
# print_query("EXEC SelectAllCustomers @City = 'London'")

#### SQL Comments

In [99]:
# Single Line
query = ''' 
-- Select all:
SELECT * FROM Customers
'''
print_query(query)

query = ''' 
SELECT * FROM Customers -- WHERE City='Berlin'
'''
print_query(query)

query = ''' 
-- SELECT * FROM Customers;
SELECT * FROM Products
'''
print_query(query)

-- Select all:
SELECT * FROM Customers

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 119 more rows.
Total rows (if limit is removed): 125
--------------------------------------------------

SELECT * FROM Customers -- WHERE City='Berlin'

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 119 more rows.
Total rows (if limit is removed): 125
--------------------------------------------------

-- SELECT * FROM Customers;
SELECT * FROM Products

Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
(6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [100]:
# Multiple Line
query = ''' 
/*Select all the columns
of all the records
in the Customers table:*/
SELECT * FROM Customers
'''
print_query(query)

/*Select all the columns
of all the records
in the Customers table:*/
SELECT * FROM Customers

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 119 more rows.
Total rows (if limit is removed): 125
--------------------------------------------------

In [101]:
query = ''' 
/*SELECT * FROM Customers;
SELECT * FROM Products;
SELECT * FROM Orders;
SELECT * FROM Categories;*/
SELECT * FROM Suppliers
'''
print_query(query)

/*SELECT * FROM Customers;
SELECT * FROM Products;
SELECT * FROM Orders;
SELECT * FROM Categories;*/
SELECT * FROM Suppliers

Query Results:
(1, 'Exotic Liquid', 'Charlotte Cooper', '49 Gilbert St.', 'Londona', 'EC1 4SD', 'UK', '(171) 555-2222')
(2, 'New Orleans Cajun Delights', 'Shelley Burke', 'P.O. Box 78934', 'New Orleans', '70117', 'USA', '(100) 555-4822')
(3, "Grandma Kelly's Homestead", 'Regina Murphy', '707 Oxford Rd.', 'Ann Arbor', '48104', 'USA', '(313) 555-5735')
(4, 'Tokyo Traders', 'Yoshi Nagase', '9-8 Sekimai Musashino-shi', 'Tokyo', '100', 'Japan', '(03) 3555-5011')
(5, "Cooperativa de Quesos 'Las Cabras'", 'Antonio del Valle Saavedra', 'Calle del Rosal 4', 'Oviedo', '33007', 'Spain', '(98) 598 76 54')
(6, "Mayumi's", 'Mayumi Ohno', '92 Setsuko Chuo-ku', 'Osaka', '545', 'Japan', '(06) 431-7877')
...and 23 more rows.
Total rows (if limit is removed): 29
--------------------------------------------------

In [102]:
query = ''' 
SELECT * FROM Customers WHERE (CustomerName LIKE 'L%'
OR CustomerName LIKE 'R%' /*OR CustomerName LIKE 'S%'
OR CustomerName LIKE 'T%'*/ OR CustomerName LIKE 'W%')
AND Country='USA'
ORDER BY CustomerName
'''
print_query(query)

query = ''' 
SELECT * FROM Customers WHERE (CustomerName LIKE 'L%'
OR CustomerName LIKE 'R%' /*OR CustomerName LIKE 'S%'
OR CustomerName LIKE 'T%'*/ OR CustomerName LIKE 'W%')
AND Country='USA'
ORDER BY CustomerName
'''
print_query(query)

SELECT * FROM Customers WHERE (CustomerName LIKE 'L%'
OR CustomerName LIKE 'R%' /*OR CustomerName LIKE 'S%'
OR CustomerName LIKE 'T%'*/ OR CustomerName LIKE 'W%')
AND Country='USA'
ORDER BY CustomerName

Query Results:
(43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA')
(45, "Let''s Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA')
(48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA')
(65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA')
(89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA')
Total rows (if limit is removed): 5
--------------------------------------------------

SELECT * FROM Customers WHERE (CustomerName LIKE 'L%'
OR CustomerName LIKE 'R%' /*OR CustomerName LIKE 'S%'
OR CustomerName LIKE 'T%'*/ OR CustomerName LIKE 'W%')
AND Country='USA'
ORDER BY CustomerName

Query Results:
(43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA')
(45, "Let''s Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA')
(48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA')
(65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA')
(89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA')
Total rows (if limit is removed): 5
--------------------------------------------------

#### SQL Operators

#### SQL Arithmetic Operators

In [105]:
print_query("SELECT 30 + 20")
print_query("SELECT 30 - 20")
print_query("SELECT 30 * 20")
print_query("SELECT 30 / 20")
print_query("SELECT 30 % 20")

SELECT 30 + 20
Query Results:
(50,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT 30 - 20
Query Results:
(10,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT 30 * 20
Query Results:
(600,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT 30 / 20
Query Results:
(1,)
Total rows (if limit is removed): 1
--------------------------------------------------
SELECT 30 % 20
Query Results:
(10,)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL Bitwise Operators

In [106]:
# &: AND
# &: OR
# &: XOR

#### SQL Comparison Operators

In [107]:
# =	Equal to	
print_query("SELECT * FROM Products WHERE Price = 18")
# >	Greater than
print_query("SELECT * FROM Products WHERE Price > 30")

SELECT * FROM Products WHERE Price = 18
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(35, 'Steeleye Stout', 16, 1, '24 - 12 oz bottles', 18)
(39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18)
(76, 'Lakkalikööri', 23, 1, '500 ml', 18)
Total rows (if limit is removed): 4
--------------------------------------------------
SELECT * FROM Products WHERE Price > 30
Query Results:
(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
(10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)
(12, 'Queso Manchego La Pastora', 5, 4, '10 - 500 g pkgs.', 38)
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
...and 18 more rows.
Total rows (if limit is removed): 24
--------------------------------------------------

In [108]:
# <	Less than	
print_query("SELECT * FROM Products WHERE Price < 30")
# >=	Greater than or equal to	
print_query("SELECT * FROM Products WHERE Price >= 30")

SELECT * FROM Products WHERE Price < 30
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
(6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25)
...and 46 more rows.
Total rows (if limit is removed): 52
--------------------------------------------------
SELECT * FROM Products WHERE Price >= 30
Query Results:
(7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30)
(8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
(10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)
(12, 'Queso Manchego La Pastora', 5, 4, '10 - 500 g pkgs.', 38)
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
...and 19 more rows.
Total rows (if limit is removed): 25
--------------------------------------------------

In [109]:
# <=	Less than or equal to	
print_query("SELECT * FROM Products WHERE Price  <= 30")
# <>	Not equal to	
print_query("SELECT * FROM Products WHERE Price <> 30")

SELECT * FROM Products WHERE Price  <= 30
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
(6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25)
...and 47 more rows.
Total rows (if limit is removed): 53
--------------------------------------------------
SELECT * FROM Products WHERE Price <> 30
Query Results:
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
(6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25)
...and 70 more rows.
Total rows (if limit is removed): 76
--------------------------------------------------

#### SQL Compound Operators

+=	Add equals  
-=	Subtract equals  
*=	Multiply equals  
/=	Divide equals  
%=	Modulo equals   
&=	Bitwise AND equals  
^-=	Bitwise exclusive equals  
|*=	Bitwise OR equals

#### SQL Logical Operators

In [112]:
# ALL	TRUE if all of the subquery values meet the condition	
# query = ''' 
# SELECT ProductName 
# FROM Products
# WHERE ProductID = ALL (SELECT ProductID FROM OrderDetails WHERE Quantity = 10)
# '''
# print_query(query)

In [113]:
# AND	TRUE if all the conditions separated by AND is TRUE	
query = ''' 
SELECT * FROM Customers
WHERE City = "London" AND Country = "UK"
'''
print_query(query)

SELECT * FROM Customers
WHERE City = "London" AND Country = "UK"

Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
(19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
(72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')
Total rows (if limit is removed): 6
--------------------------------------------------

In [115]:
# ANY	TRUE if any of the subquery values meet the condition	
# query = ''' 
# SELECT * FROM Products
# WHERE Price > ANY (SELECT Price FROM Products WHERE Price > 50)
# '''
# print_query(query)

In [118]:
# BETWEEN	TRUE if the operand is within the range of comparisons	
# query = ''' 
# print_query(query)
# SELECT * FROM Products
# WHERE Price BETWEEN 50 AND 60
# '''
# print_query(query)

In [119]:
# EXISTS	TRUE if the subquery returns one or more records	
query = ''' 
SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20)
'''
print_query(query)

SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20)

Query Results:
('Exotic Liquid',)
('New Orleans Cajun Delights',)
('Tokyo Traders',)
("Mayumi's",)
('Pavlova, Ltd.',)
('Specialty Biscuits, Ltd.',)
...and 18 more rows.
Total rows (if limit is removed): 24
--------------------------------------------------

In [120]:
# IN	TRUE if the operand is equal to one of a list of expressions	
query = ''' 
SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20)
'''
print_query(query)

In [127]:
# LIKE	TRUE if the operand matches a pattern	
query = ''' 
SELECT * FROM Customers
WHERE City LIKE 's%'
'''
print_query(query)

SELECT * FROM Customers
WHERE City LIKE 's%'

Query Results:
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil')
(21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(35, 'HILARIÓN-Abastos', 'Carlos Hernández', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristóbal', '5022', 'Venezuela')
(45, "Let''s Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA')
...and 17 more rows.
Total rows (if limit is removed): 23
--------------------------------------------------

In [128]:
# NOT	Displays a record if the condition(s) is NOT TRUE	
query = ''' 
SELECT * FROM Customers
WHERE City NOT LIKE 's%'
'''
print_query(query)

SELECT * FROM Customers
WHERE City NOT LIKE 's%'

Query Results:
(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 96 more rows.
Total rows (if limit is removed): 102
--------------------------------------------------

In [129]:
# OR	TRUE if any of the conditions separated by OR is TRUE
query = ''' 
SELECT * FROM Customers
WHERE City = "London" OR Country = "UK"
'''
print_query(query)

SELECT * FROM Customers
WHERE City = "London" OR Country = "UK"

Query Results:
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B''s Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')
(19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK')
(38, 'Island Trading', 'Helen Bennett', 'Garden House Crowther Way', 'Cowes', 'PO31 7PJ', 'UK')
(53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')
...and 4 more rows.
Total rows (if limit is removed): 10
--------------------------------------------------

In [131]:
# SOME	TRUE if any of the subquery values meet the condition
# query = ''' 
# SELECT * FROM Products
# WHERE Price > SOME (SELECT Price FROM Products WHERE Price > 20)
# '''
# print_query(query)